app/controllers/reports_controller.rb

  def display
    @reports = Report.where(upload_number: params[:upload_number]).order(:employee_id, :pay_year, :pay_month, :pay_period)
---
SELECT "reports".* FROM "reports" WHERE "reports"."upload_number" = ? ORDER BY "reports"."employee_id" ASC, "reports"."pay_year" ASC, "reports"."pay_month" ASC, "reports"."pay_period" ASC  [["upload_number", 43]]