app/models/report.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "work_logs".* FROM "work_logs" WHERE "work_logs"."employee_id" = ?  [["employee_id", 1]]
INSERT INTO "reports" ("pay_period", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pay_period", 1], ["employee_id", 1], ["created_at", "2018-08-27 13:52:54.708133"], ["updated_at", "2018-08-27 13:52:54.708133"]]
SELECT  "reports".* FROM "reports" WHERE "reports"."employee_id" = ? AND "reports"."pay_period" = ? ORDER BY "reports"."id" ASC LIMIT ?  [["employee_id", 1], ["pay_period", 1], ["LIMIT", 1]]
UPDATE "reports" SET "pay_month" = ?, "pay_year" = ?, "amount_paid" = ?, "upload_number" = ?, "updated_at" = ? WHERE "reports"."id" = ?  [["pay_month", 11], ["pay_year", 2016], ["amount_paid", 150.0], ["upload_number", 43], ["updated_at", "2018-08-27 13:52:54.721184"], ["id", 1]]
---
  def self.generate(employee_ids, upload_number)
    employee_ids.each do |employee_id|
      employee = Employee.find(employee_id)
puts "-----------------EMPLOYEE ID"
puts employee.id
      employee.work_logs.select{|log| log.upload_number == upload_number}.each do |work_log|
        if work_log.date.day >= 1 && work_log.date.day <= 15
          pay_period = 1
        else
          pay_period = 2
        end
        report = Report.where(:employee_id => employee.id, :pay_period => pay_period).first_or_create
puts "-----------------REPORT ID"
puts report.id
        report.pay_period = pay_period
        report.employee_id = employee.id
        report.upload_number = upload_number
        report.pay_month = work_log.date.month
        report.pay_year = work_log.date.year
        if employee.job_group == "A"
          report.amount_paid += work_log.hours_worked * 20
        else
          report.amount_paid += work_log.hours_worked * 30
        end
        report.save!