app/models/work_log.rb

SELECT  1 AS one FROM "work_logs" WHERE "work_logs"."upload_number" = ? LIMIT ?  [["upload_number", 43], ["LIMIT", 1]]
INSERT INTO "employees" ("id", "job_group", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id", 1], ["job_group", "A"], ["created_at", "2018-08-27 13:52:54.049421"], ["updated_at", "2018-08-27 13:52:54.049421"]]
UPDATE "employees" SET "job_group" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["job_group", "A"], ["updated_at", "2018-08-27 13:52:54.635949"], ["id", 4]]
INSERT INTO "work_logs" ("date", "hours_worked", "upload_number", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2016-11-14"], ["hours_worked", 7.5], ["upload_number", 43], ["employee_id", 1], ["created_at", "2018-08-27 13:52:54.075283"], ["updated_at", "2018-08-27 13:52:54.075283"]]
---
  def self.import(file)
    spreadsheet = Roo::Spreadsheet.open(file.path)
    header = spreadsheet.row(1)
    header.collect! { |column_name|
      column_name == "date"? column_name : column_name.gsub!(" ", "_")
    }
    upload_number = Integer(spreadsheet.row(spreadsheet.last_row)[1])
    raise Exception.new("Upload number already exists") if !WorkLog.where(upload_number: upload_number).empty?

    employee_ids = []

    (2..spreadsheet.last_row - 1).each do |i|
      employee = Employee.find_or_create_by(id: spreadsheet.row(i)[2])
      employee.job_group = spreadsheet.row(i)[3]
      employee.save!
      work_log = new
      work_log.employee_id = Integer(spreadsheet.row(i)[2])
      work_log.date = Date.parse(spreadsheet.row(i)[0])
      work_log.hours_worked = Float(spreadsheet.row(i)[1])
      work_log.upload_number = upload_number
      work_log.save!